; domain
(define (domain rover)
(:requirements :typing)
(:types 	rover waypoint store camera mode lander objective - object
)

(:predicates (at ?x - rover ?y - waypoint)
	(at_lander ?x - lander ?y - waypoint)
	(can_traverse ?r - rover ?x - waypoint ?y - waypoint)
	(equipped_for_soil_analysis ?r - rover)
	(equipped_for_rock_analysis ?r - rover)
	(equipped_for_imaging ?r - rover)
	(empty ?s - store)
	(have_rock_analysis ?r - rover ?w - waypoint)
	(have_soil_analysis ?r - rover ?w - waypoint)
	(full ?s - store)
	(calibrated ?c - camera ?r - rover)
	(supports ?c - camera ?m - mode)
	(available ?r - rover)
	(visible ?w - waypoint ?p - waypoint)
	(have_image ?r - rover ?o - objective ?m - mode)
	(communicated_soil_data ?w - waypoint)
	(communicated_rock_data ?w - waypoint)
	(communicated_image_data ?o - objective ?m - mode)
	(at_soil_sample ?w - waypoint)
	(at_rock_sample ?w - waypoint)
	(visible_from ?o - objective ?w - waypoint)
	(store_of ?s - store ?r - rover)
	(calibration_target ?i - camera ?o - objective)
	(on_board ?i - camera ?r - rover)
	(channel_free ?l - lander)
)

(:action navigate
	:parameters   (?x - rover ?y - waypoint ?z - waypoint)
	:precondition (and (visible ?y ?z) (can_traverse ?x ?y ?z) (available ?x) (at ?x ?y))
	:effect       (and (at ?x ?z) (not (at ?x ?y))
))

(:action sample_soil
	:parameters   (?x - rover ?s - store ?p - waypoint)
	:precondition (and (store_of ?s ?x) (equipped_for_soil_analysis ?x) (at ?x ?p) (empty ?s) (at_soil_sample ?p))
	:effect       (and (have_soil_analysis ?x ?p) (full ?s) (not (empty ?s)) (not (at_soil_sample ?p))
))

(:action sample_rock
	:parameters   (?x - rover ?s - store ?p - waypoint)
	:precondition (and (store_of ?s ?x) (at ?x ?p) (empty ?s) (equipped_for_rock_analysis ?x) (at_rock_sample ?p))
	:effect       (and (have_rock_analysis ?x ?p) (full ?s) (not (empty ?s)) (not (at_rock_sample ?p))
))

(:action drop
	:parameters   (?x - rover ?y - store)
	:precondition (and (store_of ?y ?x) (full ?y))
	:effect       (and (empty ?y) (not (full ?y))
))

(:action calibrate
	:parameters   (?r - rover ?i - camera ?t - objective ?w - waypoint)
	:precondition (and (calibration_target ?i ?t) (visible_from ?t ?w) (on_board ?i ?r) (equipped_for_imaging ?r) (at ?r ?w))
	:effect       (and (calibrated ?i ?r)
))

(:action take_image
	:parameters   (?r - rover ?p - waypoint ?o - objective ?i - camera ?m - mode)
	:precondition (and (at ?r ?p) (supports ?i ?m) (on_board ?i ?r) (equipped_for_imaging ?r) (calibrated ?i ?r) (visible_from ?o ?p))
	:effect       (and (have_image ?r ?o ?m) (not (calibrated ?i ?r))
))

(:action communicate_soil_data
	:parameters   (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
	:precondition (and (available ?r) (have_soil_analysis ?r ?p) (channel_free ?l) (visible ?x ?y) (at ?r ?x) (at_lander ?l ?y))
	:effect       (and (communicated_soil_data ?p)
))

(:action communicate_rock_data
	:parameters   (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
	:precondition (and (available ?r) (channel_free ?l) (visible ?x ?y) (have_rock_analysis ?r ?p) (at ?r ?x) (at_lander ?l ?y))
	:effect       (and (communicated_rock_data ?p)
))

(:action communicate_image_data
	:parameters   (?r - rover ?l - lander ?o - objective ?m - mode ?x - waypoint ?y - waypoint)
	:precondition (and (available ?r) (have_image ?r ?o ?m) (channel_free ?l) (visible ?x ?y) (at ?r ?x) (at_lander ?l ?y))
	:effect       (and (communicated_image_data ?o ?m)
))
)

; problem
(define (problem roverprob5557) (:domain Rover)
(:objects
	general - Lander
	colour high_res low_res - Mode
	rover0 rover1 - Rover
	rover0store rover1store - Store
	waypoint0 waypoint1 waypoint2 waypoint3 waypoint4 waypoint5 waypoint6 waypoint7 waypoint8 - Waypoint
	camera0 - Camera
	objective0 - Objective
	)
(:init
	(visible waypoint0 waypoint1)
	(visible waypoint1 waypoint0)
	(visible waypoint0 waypoint3)
	(visible waypoint3 waypoint0)
	(visible waypoint0 waypoint4)
	(visible waypoint4 waypoint0)
	(visible waypoint0 waypoint8)
	(visible waypoint8 waypoint0)
	(visible waypoint1 waypoint3)
	(visible waypoint3 waypoint1)
	(visible waypoint1 waypoint4)
	(visible waypoint4 waypoint1)
	(visible waypoint1 waypoint6)
	(visible waypoint6 waypoint1)
	(visible waypoint1 waypoint7)
	(visible waypoint7 waypoint1)
	(visible waypoint1 waypoint8)
	(visible waypoint8 waypoint1)
	(visible waypoint2 waypoint1)
	(visible waypoint1 waypoint2)
	(visible waypoint2 waypoint5)
	(visible waypoint5 waypoint2)
	(visible waypoint2 waypoint6)
	(visible waypoint6 waypoint2)
	(visible waypoint3 waypoint2)
	(visible waypoint2 waypoint3)
	(visible waypoint3 waypoint5)
	(visible waypoint5 waypoint3)
	(visible waypoint4 waypoint6)
	(visible waypoint6 waypoint4)
	(visible waypoint5 waypoint1)
	(visible waypoint1 waypoint5)
	(visible waypoint5 waypoint6)
	(visible waypoint6 waypoint5)
	(visible waypoint6 waypoint3)
	(visible waypoint3 waypoint6)
	(visible waypoint7 waypoint0)
	(visible waypoint0 waypoint7)
	(visible waypoint7 waypoint2)
	(visible waypoint2 waypoint7)
	(visible waypoint7 waypoint4)
	(visible waypoint4 waypoint7)
	(visible waypoint8 waypoint2)
	(visible waypoint2 waypoint8)
	(visible waypoint8 waypoint3)
	(visible waypoint3 waypoint8)
	(visible waypoint8 waypoint7)
	(visible waypoint7 waypoint8)
	(at_soil_sample waypoint0)
	(at_rock_sample waypoint1)
	(at_soil_sample waypoint3)
	(at_soil_sample waypoint4)
	(at_rock_sample waypoint5)
	(at_soil_sample waypoint6)
	(at_rock_sample waypoint6)
	(at_soil_sample waypoint7)
	(at_soil_sample waypoint8)
	(at_rock_sample waypoint8)
	(at_lander general waypoint3)
	(channel_free general)
	(at rover0 waypoint0)
	(available rover0)
	(store_of rover0store rover0)
	(empty rover0store)
	(equipped_for_soil_analysis rover0)
	(equipped_for_rock_analysis rover0)
	(can_traverse rover0 waypoint0 waypoint1)
	(can_traverse rover0 waypoint1 waypoint0)
	(can_traverse rover0 waypoint0 waypoint3)
	(can_traverse rover0 waypoint3 waypoint0)
	(can_traverse rover0 waypoint0 waypoint4)
	(can_traverse rover0 waypoint4 waypoint0)
	(can_traverse rover0 waypoint0 waypoint8)
	(can_traverse rover0 waypoint8 waypoint0)
	(can_traverse rover0 waypoint1 waypoint2)
	(can_traverse rover0 waypoint2 waypoint1)
	(can_traverse rover0 waypoint1 waypoint5)
	(can_traverse rover0 waypoint5 waypoint1)
	(can_traverse rover0 waypoint1 waypoint6)
	(can_traverse rover0 waypoint6 waypoint1)
	(can_traverse rover0 waypoint8 waypoint7)
	(can_traverse rover0 waypoint7 waypoint8)
	(at rover1 waypoint2)
	(available rover1)
	(store_of rover1store rover1)
	(empty rover1store)
	(equipped_for_rock_analysis rover1)
	(equipped_for_imaging rover1)
	(can_traverse rover1 waypoint2 waypoint1)
	(can_traverse rover1 waypoint1 waypoint2)
	(can_traverse rover1 waypoint2 waypoint6)
	(can_traverse rover1 waypoint6 waypoint2)
	(can_traverse rover1 waypoint2 waypoint8)
	(can_traverse rover1 waypoint8 waypoint2)
	(can_traverse rover1 waypoint1 waypoint0)
	(can_traverse rover1 waypoint0 waypoint1)
	(can_traverse rover1 waypoint1 waypoint4)
	(can_traverse rover1 waypoint4 waypoint1)
	(can_traverse rover1 waypoint1 waypoint5)
	(can_traverse rover1 waypoint5 waypoint1)
	(can_traverse rover1 waypoint1 waypoint7)
	(can_traverse rover1 waypoint7 waypoint1)
	(can_traverse rover1 waypoint8 waypoint3)
	(can_traverse rover1 waypoint3 waypoint8)
	(on_board camera0 rover1)
	(calibration_target camera0 objective0)
	(supports camera0 high_res)
	(supports camera0 low_res)
	(visible_from objective0 waypoint1)
	(visible_from objective0 waypoint4)
	(visible_from objective0 waypoint5)
	(visible_from objective0 waypoint7)
)

(:goal (and
(communicated_soil_data waypoint8)
(communicated_soil_data waypoint7)
(communicated_soil_data waypoint6)
(communicated_soil_data waypoint4)
(communicated_soil_data waypoint3)
(communicated_rock_data waypoint8)
(communicated_rock_data waypoint1)
(communicated_rock_data waypoint6)
(communicated_rock_data waypoint5)
(communicated_image_data objective0 low_res)
(communicated_image_data objective0 high_res)
	)
)
)

; plan
1. (navigate rover1 waypoint2 waypoint1)
   deleted: (at rover1 waypoint2)
   added: (at rover1 waypoint1)
   goals met: 0 of 11
2. (calibrate rover1 camera0 objective0 waypoint1)
   added: (calibrated camera0 rover1)
   goals met: 0 of 11
3. (take_image rover1 waypoint1 objective0 camera0 high_res)
   deleted: (calibrated camera0 rover1)
   added: (have_image rover1 objective0 high_res)
   goals met: 0 of 11
4. (navigate rover0 waypoint0 waypoint8)
   deleted: (at rover0 waypoint0)
   added: (at rover0 waypoint8)
   goals met: 0 of 11
5. (sample_soil rover0 rover0store waypoint8)
   deleted: (empty rover0store) (at_soil_sample waypoint8)
   added: (have_soil_analysis rover0 waypoint8) (full rover0store)
   goals met: 0 of 11
6. (drop rover0 rover0store)
   deleted: (full rover0store)
   added: (empty rover0store)
   goals met: 0 of 11
7. (sample_rock rover0 rover0store waypoint8)
   deleted: (empty rover0store) (at_rock_sample waypoint8)
   added: (have_rock_analysis rover0 waypoint8) (full rover0store)
   goals met: 0 of 11
8. (navigate rover0 waypoint8 waypoint7)
   deleted: (at rover0 waypoint8)
   added: (at rover0 waypoint7)
   goals met: 0 of 11
9. (drop rover0 rover0store)
   deleted: (full rover0store)
   added: (empty rover0store)
   goals met: 0 of 11
10. (sample_soil rover0 rover0store waypoint7)
   deleted: (empty rover0store) (at_soil_sample waypoint7)
   added: (have_soil_analysis rover0 waypoint7) (full rover0store)
   goals met: 0 of 11
11. (navigate rover0 waypoint7 waypoint8)
   deleted: (at rover0 waypoint7)
   added: (at rover0 waypoint8)
   goals met: 0 of 11
12. (navigate rover0 waypoint8 waypoint0)
   deleted: (at rover0 waypoint8)
   added: (at rover0 waypoint0)
   goals met: 0 of 11
13. (navigate rover0 waypoint0 waypoint4)
   deleted: (at rover0 waypoint0)
   added: (at rover0 waypoint4)
   goals met: 0 of 11
14. (drop rover0 rover0store)
   deleted: (full rover0store)
   added: (empty rover0store)
   goals met: 0 of 11
15. (sample_soil rover0 rover0store waypoint4)
   deleted: (empty rover0store) (at_soil_sample waypoint4)
   added: (have_soil_analysis rover0 waypoint4) (full rover0store)
   goals met: 0 of 11
16. (navigate rover0 waypoint4 waypoint0)
   deleted: (at rover0 waypoint4)
   added: (at rover0 waypoint0)
   goals met: 0 of 11
17. (navigate rover0 waypoint0 waypoint3)
   deleted: (at rover0 waypoint0)
   added: (at rover0 waypoint3)
   goals met: 0 of 11
18. (drop rover0 rover0store)
   deleted: (full rover0store)
   added: (empty rover0store)
   goals met: 0 of 11
19. (sample_soil rover0 rover0store waypoint3)
   deleted: (empty rover0store) (at_soil_sample waypoint3)
   added: (have_soil_analysis rover0 waypoint3) (full rover0store)
   goals met: 0 of 11
20. (navigate rover0 waypoint3 waypoint0)
   deleted: (at rover0 waypoint3)
   added: (at rover0 waypoint0)
   goals met: 0 of 11
21. (navigate rover0 waypoint0 waypoint1)
   deleted: (at rover0 waypoint0)
   added: (at rover0 waypoint1)
   goals met: 0 of 11
22. (drop rover0 rover0store)
   deleted: (full rover0store)
   added: (empty rover0store)
   goals met: 0 of 11
23. (sample_rock rover0 rover0store waypoint1)
   deleted: (empty rover0store) (at_rock_sample waypoint1)
   added: (have_rock_analysis rover0 waypoint1) (full rover0store)
   goals met: 0 of 11
24. (navigate rover0 waypoint1 waypoint6)
   deleted: (at rover0 waypoint1)
   added: (at rover0 waypoint6)
   goals met: 0 of 11
25. (drop rover0 rover0store)
   deleted: (full rover0store)
   added: (empty rover0store)
   goals met: 0 of 11
26. (sample_rock rover0 rover0store waypoint6)
   deleted: (empty rover0store) (at_rock_sample waypoint6)
   added: (have_rock_analysis rover0 waypoint6) (full rover0store)
   goals met: 0 of 11
27. (communicate_soil_data rover0 general waypoint7 waypoint6 waypoint3)
   added: (communicated_soil_data waypoint7)
   goals met: 1 of 11
28. (communicate_soil_data rover0 general waypoint4 waypoint6 waypoint3)
   added: (communicated_soil_data waypoint4)
   goals met: 2 of 11
29. (communicate_soil_data rover0 general waypoint3 waypoint6 waypoint3)
   added: (communicated_soil_data waypoint3)
   goals met: 3 of 11
30. (communicate_rock_data rover0 general waypoint8 waypoint6 waypoint3)
   added: (communicated_rock_data waypoint8)
   goals met: 4 of 11
31. (communicate_rock_data rover0 general waypoint6 waypoint6 waypoint3)
   added: (communicated_rock_data waypoint6)
   goals met: 5 of 11
32. (communicate_rock_data rover0 general waypoint1 waypoint6 waypoint3)
   added: (communicated_rock_data waypoint1)
   goals met: 6 of 11
33. (communicate_image_data rover1 general objective0 high_res waypoint1 waypoint3)
   added: (communicated_image_data objective0 high_res)
   goals met: 7 of 11
34. (calibrate rover1 camera0 objective0 waypoint1)
   added: (calibrated camera0 rover1)
   goals met: 7 of 11
35. (communicate_soil_data rover0 general waypoint8 waypoint6 waypoint3)
   added: (communicated_soil_data waypoint8)
   goals met: 8 of 11
36. (drop rover0 rover0store)
   deleted: (full rover0store)
   added: (empty rover0store)
   goals met: 8 of 11
37. (navigate rover1 waypoint1 waypoint5)
   deleted: (at rover1 waypoint1)
   added: (at rover1 waypoint5)
   goals met: 8 of 11
38. (sample_rock rover1 rover1store waypoint5)
   deleted: (empty rover1store) (at_rock_sample waypoint5)
   added: (have_rock_analysis rover1 waypoint5) (full rover1store)
   goals met: 8 of 11
39. (communicate_rock_data rover1 general waypoint5 waypoint5 waypoint3)
   added: (communicated_rock_data waypoint5)
   goals met: 9 of 11
40. (sample_soil rover0 rover0store waypoint6)
   deleted: (empty rover0store) (at_soil_sample waypoint6)
   added: (have_soil_analysis rover0 waypoint6) (full rover0store)
   goals met: 9 of 11
41. (communicate_soil_data rover0 general waypoint6 waypoint6 waypoint3)
   added: (communicated_soil_data waypoint6)
   goals met: 10 of 11
42. (take_image rover1 waypoint5 objective0 camera0 low_res)
   deleted: (calibrated camera0 rover1)
   added: (have_image rover1 objective0 low_res)
   goals met: 10 of 11
43. (communicate_image_data rover1 general objective0 low_res waypoint5 waypoint3)
   added: (communicated_image_data objective0 low_res)
   goals met: 11 of 11
